nbd_fio_results/dev-nbd0_2023-07-17_17:16/seq_r_nbd0_4iodepth/2048.txt
read: (g=0): rw=read, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

read: (groupid=0, jobs=1): err= 0: pid=16026: Mon Jul 17 17:31:58 2023
   read: IOPS=1021, BW=2042MiB/s (2141MB/s)(39.9GiB/20003msec)
    slat (usec): min=51, max=1412, avg=145.33, stdev=70.97
    clat (usec): min=2277, max=5944, avg=3765.48, stdev=100.96
     lat (usec): min=2883, max=6109, avg=3915.36, stdev=90.73
    clat percentiles (usec):
     |  1.00th=[ 3556],  5.00th=[ 3621], 10.00th=[ 3654], 20.00th=[ 3687],
     | 30.00th=[ 3720], 40.00th=[ 3752], 50.00th=[ 3752], 60.00th=[ 3785],
     | 70.00th=[ 3818], 80.00th=[ 3851], 90.00th=[ 3884], 95.00th=[ 3916],
     | 99.00th=[ 4015], 99.50th=[ 4047], 99.90th=[ 4228], 99.95th=[ 4293],
     | 99.99th=[ 5473]
   bw (  MiB/s): min= 1984, max= 2052, per=99.99%, avg=2041.90, stdev=10.60, samples=40
   iops        : min=  992, max= 1026, avg=1020.92, stdev= 5.30, samples=40
  lat (msec)   : 4=98.90%, 10=1.10%
  cpu          : usr=0.38%, sys=7.61%, ctx=386329, majf=0, minf=1037
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20424,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2042MiB/s (2141MB/s), 2042MiB/s-2042MiB/s (2141MB/s-2141MB/s), io=39.9GiB (42.8GB), run=20003-20003msec

Disk stats (read/write):
  nbd0: ios=324858/0, merge=0/0, ticks=1094611/0, in_queue=1055644, util=99.55%